# PropertyAreaOpen Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..PropertyAreaOpen Property
ParameterTypeId Class See Also
---
"Area"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId PropertyAreaOpen { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property PropertyAreaOpen As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ PropertyAreaOpen {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace